app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]
---
def create
  @school_class = SchoolClass.new(params.require(:school_class))
  @school_class.save