app/controllers/students_controller.rb

def update
  @student = Student.find(params[:id])
  @student.update(params[:student])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-07-06 05:01:22.709690"], ["id", 1]]